Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/employment/employment_rights_and_conditions/leave_and_holidays/maternity_leave.html.txt.tmx
Source language: en
Languages: pl

source: You may only request that your maternity leave be postponed once you have taken at least 14 weeks' maternity leave, 4 of which must have been taken after the birth
pl: Z wnioskiem o przesunięcie terminu wykorzystania urlopu macierzyńskiego można się zwrócić tylko po wykorzystaniu co najmniej 14 tygodni urlopu macierzyńskiego, którego 4 tygodnie muszą być wykorzystane po porodzie

source: (This provision does not apply to fathers who are on maternity leave)
pl: (Ten przepis nie dotyczy ojców korzystających z urlopu macierzyńskiego)

source: If you postpone your maternity leave and return to work, then you may take your leave in one block, not later than 7 days after the child has been discharged from hospital
pl: Jeżeli pracownica przesunie termin wykorzystania urlopu macierzyńskiego i wróci do pracy, może wziąć ten urlop w jednym bloku, nie później niż 7 dni po wypisaniu dziecka ze szpitala

source: Your employer may request a letter from the hospital confirming the child has been hospitalised and following discharge, a letter confirming the date of discharge
pl: Pracodawca ma prawo poprosić o pismo ze szpitala potwierdzające fakt hospitalizacji dziecka, a po wypisaniu go, o pismo potwierdzające datę wypisania

source: If you postpone your maternity leave and return to employment, you need to notify the Department of Social Protection of this
pl: W przypadku przesunięcia terminu wykorzystania urlopu macierzyńskiego i powrotu do pracy należy powiadomić o tym Ministerstwo Spraw Społecznych i Rodziny (Department of Social and Family Affairs)

source: You must notify them in writing that your child has been hospitalised and you have returned to employment
pl: Pracownica musi poinformować Ministerstwo na piśmie, że dziecko zostało hospitalizowane, a ona wróciła do pracy

source: A letter from your family doctor (GP)/hospital is required to confirm to the Department that the child has been discharged from hospital and your maternity benefit should resume
pl: Ministerstwo wymaga pisma od lekarza rodzinnego (GP) lub ze szpitala potwierdzającego, że dziecko zostało wypisane ze szpitala i wtedy powinno nastąpić wznowienie wypłacania zasiłku macierzyńskiego

source: Your Personal Public Service Number (PPS) Number should be clearly identified on all documents you send to the Department
pl: Na wszystkich dokumentach przesyłanych do Ministerstwa powinien być wyraźnie podany numer ubezpieczenia społecznego (numer PPS) pracownicy

source: Remember, you may only apply to postpone your maternity leave if the baby has been hospitalised - not if the child is simply unwell
pl: Należy pamiętać, że wniosek o przesunięcie terminu wykorzystania urlopu macierzyńskiego można złożyć tylko, jeśli dziecko zostało hospitalizowane – nie w przypadku, kiedy dziecko po prostu jest chore

source: Illness while on postponed maternity leave
pl: Choroba w czasie przesuniętego urlopu macierzyńskiego

source: If you have postponed your maternity leave and become ill when you return to work (before resuming your postponed leave), you may be considered to have started your resumed leave on the first day of your absence because of illness
pl: W przypadku przesunięcia terminu wykorzystania urlopu macierzyńskiego i rozchorowania się po powrocie do pracy (przed rozpoczęciem ponownego korzystania z urlopu macierzyńskiego) można wziąć pod uwagę powrót na urlop macierzyński pierwszego dnia nieobecności spowodowanej chorobą

source: Alternatively, you may choose to forfeit your right to resumed leave and have your leave treated as sick leave
pl: Alternatywnie można wybrać rezygnację z prawa do powrotu na urlop macierzyński i potraktowanie nieobecności jako przebywania na zwolnieniu lekarskim
